simulation_setups/test_cases/of_cavity_ascii/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh
runApplication icoFoam
runApplication -s "volumnes" postProcess -func "writeCellVolumes" -constant -time none
runApplication -s "centres" postProcess -func "writeCellCentres" -constant -time none

#------------------------------------------------------------------------------
